Figure_18/zfs_qat_test/silesia_chunk_4kread_lat_test/latency_res/09_29-10_56/nocomp/128K/out_09_29-11_08_49.txt
#############################################################
align: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
fio-3.35-118-g4a0c76
Starting 1 process

align: (groupid=0, jobs=1): err= 0: pid=6366: Sun Sep 29 11:09:56 2024
  read: IOPS=5828, BW=22.8MiB/s (23.9MB/s)(1513MiB/66442msec)
    clat (usec): min=12, max=900, avg=132.69, stdev=17.14
     lat (usec): min=12, max=900, avg=132.71, stdev=17.14
    clat percentiles (usec):
     |  1.00th=[  117],  5.00th=[  122], 10.00th=[  124], 20.00th=[  126],
     | 30.00th=[  128], 40.00th=[  129], 50.00th=[  130], 60.00th=[  133],
     | 70.00th=[  135], 80.00th=[  137], 90.00th=[  147], 95.00th=[  155],
     | 99.00th=[  190], 99.50th=[  221], 99.90th=[  330], 99.95th=[  371],
     | 99.99th=[  537]
   bw (  KiB/s): min= 8864, max=29504, per=100.00%, avg=23344.20, stdev=3519.00, samples=132
   iops        : min= 2216, max= 7376, avg=5836.03, stdev=879.76, samples=132
  lat (usec)   : 20=0.20%, 50=0.01%, 100=0.01%, 250=99.49%, 500=0.28%
  lat (usec)   : 750=0.01%, 1000=0.01%
  cpu          : usr=22.84%, sys=8.59%, ctx=386987, majf=0, minf=8
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=100.0%, 4=0.1%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=387238,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=22.8MiB/s (23.9MB/s), 22.8MiB/s-22.8MiB/s (23.9MB/s-23.9MB/s), io=1513MiB (1586MB), run=66442-66442msec
 
zfs_prefetch_disable: 1
zfs_arc_max_val: 0
zfs_arc_min_val: 0
zfs_qat_compress_disable: 
 
compress_type: NAME         PROPERTY     VALUE           SOURCE
mypool/myfs  compression  off             local
 
blocksize: NAME         PROPERTY    VALUE    SOURCE
mypool/myfs  recordsize  128K     local
 
iters: 2
output_path: ./latency_res/09_29-10_56/nocomp/128K